{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\kwnabors\Desktop\HW1 Output.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 7 Apr 2022, 16:58:53

{com}. do "C:\Users\kwnabors\Desktop\HW1.do"
{txt}
{com}. clear 
{txt}
{com}. 
. cd C:\Users\kwnabors\desktop
{res}C:\Users\kwnabors\Desktop
{txt}
{com}. 
. ssc install estout
{txt}checking {hilite:estout} consistency and verifying not already installed...
all files already exist and are up to date.

{com}. 
. 
. use WAGE1.DTA
{txt}
{com}. *opens WAGE1 data set 
. 
. summarize wage educ

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}wage {c |}{res}        526    5.896103    3.693086        .53      24.98
{txt}{space 8}educ {c |}{res}        526    12.56274    2.769022          0         18
{txt}
{com}. * calculates mean and standard devatation for both wage and educ
. 
. hist wage, name(wagehist)
{txt}(bin={res}22{txt}, start={res}.52999997{txt}, width={res}1.1113636{txt})
{res}{txt}
{com}. *draws a histogram for wage 
. 
. hist educ, name(educhist)
{txt}(bin={res}22{txt}, start={res}0{txt}, width={res}.81818182{txt})
{res}{txt}
{com}. *draws a histogram for educ
. 
. scatter wage educ, name(scatterwageeduc)
{res}{txt}
{com}. *creates a scatterplot with educ as the x-axis and wage as the y-axis
. 
. mean wage if educ<=12
{res}
{txt}Mean estimation{col 44}{lalign 13:Number of obs}{col 57} = {res}{ralign 3:314}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 8}wage {c |}{col 14}{res}{space 2} 4.885701{col 26}{space 2} .1583978{col 37}{space 5} 4.574042{col 51}{space 3}  5.19736
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. *calculates wage if deducation is also less than or equal to 12 
. 
. ttest educ == 11, level(95)

{txt}One-sample t test
{hline 9}{c TT}{hline 68}
Variable{col 10}{c |}{col 16}Obs{col 27}Mean{col 35}Std. err.{col 47}Std. dev.{col 59}[95% conf. interval]
{hline 9}{c +}{hline 68}
    educ {c |}{res}{col 12}    526{col 22} 12.56274{col 34} .1207351{col 46} 2.769022{col 58} 12.32555{col 70} 12.79992
{txt}{hline 9}{c BT}{hline 68}
    mean = mean({res}educ{txt})                                             t = {res} 12.9435
{txt}H0: mean = {res}11                                    {txt}Degrees of freedom = {res}     525

    {txt}Ha: mean < {res}11               {txt}Ha: mean != {res}11                 {txt}Ha: mean > {res}11
 {txt}Pr(T < t) = {res}1.0000         {txt}Pr(|T| > |t|) = {res}0.0000          {txt}Pr(T > t) = {res}0.0000
{txt}
{com}. *Fail to reject the null hypothsis 
. 
. gen log_wage =log(wage)
{txt}
{com}. *creates a new variable that is the log of wage
. 
. gen diff = lwage - log_wage
{txt}
{com}. 
. summarize diff

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}diff {c |}{res}        526           0           0          0          0
{txt}
{com}. 
. clear
{txt}
{com}. sysuse auto
{txt}(1978 automobile data)

{com}. reg mpg weight foreign

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        74
{txt}{hline 13}{c +}{hline 34}   F(2, 71)        = {res}    69.75
{txt}       Model {c |} {res}  1619.2877         2  809.643849   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 824.171761        71   11.608053   {txt}R-squared       ={res}    0.6627
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6532
{txt}       Total {c |} {res} 2443.45946        73  33.4720474   {txt}Root MSE        =   {res} 3.4071

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         mpg{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}weight {c |}{col 14}{res}{space 2}-.0065879{col 26}{space 2} .0006371{col 37}{space 1}  -10.34{col 46}{space 3}0.000{col 54}{space 4}-.0078583{col 67}{space 3}-.0053175
{txt}{space 5}foreign {c |}{col 14}{res}{space 2}-1.650029{col 26}{space 2} 1.075994{col 37}{space 1}   -1.53{col 46}{space 3}0.130{col 54}{space 4}  -3.7955{col 67}{space 3} .4954422
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  41.6797{col 26}{space 2} 2.165547{col 37}{space 1}   19.25{col 46}{space 3}0.000{col 54}{space 4} 37.36172{col 67}{space 3} 45.99768
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. reg mpg foreign

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        74
{txt}{hline 13}{c +}{hline 34}   F(1, 72)        = {res}    13.18
{txt}       Model {c |} {res} 378.153515         1  378.153515   {txt}Prob > F        ={res}    0.0005
{txt}    Residual {c |} {res} 2065.30594        72  28.6848048   {txt}R-squared       ={res}    0.1548
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1430
{txt}       Total {c |} {res} 2443.45946        73  33.4720474   {txt}Root MSE        =   {res} 5.3558

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         mpg{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}foreign {c |}{col 14}{res}{space 2} 4.945804{col 26}{space 2} 1.362162{col 37}{space 1}    3.63{col 46}{space 3}0.001{col 54}{space 4} 2.230384{col 67}{space 3} 7.661225
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 19.82692{col 26}{space 2} .7427186{col 37}{space 1}   26.70{col 46}{space 3}0.000{col 54}{space 4} 18.34634{col 67}{space 3} 21.30751
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. est sto m1
{txt}
{com}. reg mpg foreign weight

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        74
{txt}{hline 13}{c +}{hline 34}   F(2, 71)        = {res}    69.75
{txt}       Model {c |} {res}  1619.2877         2  809.643849   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 824.171761        71   11.608053   {txt}R-squared       ={res}    0.6627
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6532
{txt}       Total {c |} {res} 2443.45946        73  33.4720474   {txt}Root MSE        =   {res} 3.4071

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         mpg{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}foreign {c |}{col 14}{res}{space 2}-1.650029{col 26}{space 2} 1.075994{col 37}{space 1}   -1.53{col 46}{space 3}0.130{col 54}{space 4}  -3.7955{col 67}{space 3} .4954422
{txt}{space 6}weight {c |}{col 14}{res}{space 2}-.0065879{col 26}{space 2} .0006371{col 37}{space 1}  -10.34{col 46}{space 3}0.000{col 54}{space 4}-.0078583{col 67}{space 3}-.0053175
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  41.6797{col 26}{space 2} 2.165547{col 37}{space 1}   19.25{col 46}{space 3}0.000{col 54}{space 4} 37.36172{col 67}{space 3} 45.99768
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. est sto m2
{txt}
{com}. reg mpg foreign weight displacement gear_ratio

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        74
{txt}{hline 13}{c +}{hline 34}   F(4, 69)        = {res}    34.94
{txt}       Model {c |} {res} 1635.80554         4  408.951386   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 807.653917        69  11.7051292   {txt}R-squared       ={res}    0.6695
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6503
{txt}       Total {c |} {res} 2443.45946        73  33.4720474   {txt}Root MSE        =   {res} 3.4213

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         mpg{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}foreign {c |}{col 14}{res}{space 2}-2.246035{col 26}{space 2} 1.239644{col 37}{space 1}   -1.81{col 46}{space 3}0.074{col 54}{space 4}-4.719056{col 67}{space 3} .2269861
{txt}{space 6}weight {c |}{col 14}{res}{space 2} -.006752{col 26}{space 2} .0011636{col 37}{space 1}   -5.80{col 46}{space 3}0.000{col 54}{space 4}-.0090733{col 67}{space 3}-.0044307
{txt}displacement {c |}{col 14}{res}{space 2} .0082467{col 26}{space 2}  .011398{col 37}{space 1}    0.72{col 46}{space 3}0.472{col 54}{space 4}-.0144917{col 67}{space 3} .0309852
{txt}{space 2}gear_ratio {c |}{col 14}{res}{space 2} 2.057582{col 26}{space 2} 1.755167{col 37}{space 1}    1.17{col 46}{space 3}0.245{col 54}{space 4}-1.443881{col 67}{space 3} 5.559045
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 34.52195{col 26}{space 2} 6.674547{col 37}{space 1}    5.17{col 46}{space 3}0.000{col 54}{space 4}  21.2066{col 67}{space 3} 47.83731
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. est sto m3
{txt}
{com}. 
. 
. 
. *star(* 0.05 ** 0.01 *** 0.001)
. esttab m1 m2 m3, p star(+ 0.1 * 0.05 ** 0.01)
{res}
{txt}{hline 57}
{txt}                      (1)            (2)            (3)  
{txt}                      mpg            mpg            mpg  
{txt}{hline 57}
{txt}foreign     {res}        4.946**       -1.650         -2.246+ {txt}
            {res} {ralign 12:{txt:(}0.001{txt:)}}   {ralign 12:{txt:(}0.130{txt:)}}   {ralign 12:{txt:(}0.074{txt:)}}  {txt}

{txt}weight      {res}                    -0.00659**     -0.00675**{txt}
            {res}                {ralign 12:{txt:(}0.000{txt:)}}   {ralign 12:{txt:(}0.000{txt:)}}  {txt}

{txt}displacement{res}                                    0.00825  {txt}
            {res}                               {ralign 12:{txt:(}0.472{txt:)}}  {txt}

{txt}gear_ratio  {res}                                      2.058  {txt}
            {res}                               {ralign 12:{txt:(}0.245{txt:)}}  {txt}

{txt}_cons       {res}        19.83**        41.68**        34.52**{txt}
            {res} {ralign 12:{txt:(}0.000{txt:)}}   {ralign 12:{txt:(}0.000{txt:)}}   {ralign 12:{txt:(}0.000{txt:)}}  {txt}
{txt}{hline 57}
{txt}N           {res}           74             74             74  {txt}
{txt}{hline 57}
{txt}p-values in parentheses
{txt}+ p<0.1, * p<0.05, ** p<0.01

{com}. 
. clear 
{txt}
{com}. set obs 100000
{txt}{p}
Number of observations ({bf:_N}) was 0,
now 100,000.
{p_end}

{com}. gen x=rnormal(2,4)
{txt}
{com}. hist x, name(histnormal)
{txt}(bin={res}50{txt}, start={res}-15.873209{txt}, width={res}.70366436{txt})
{res}{txt}
{com}. 
. clear 
{txt}
{com}. set obs 100000
{txt}{p}
Number of observations ({bf:_N}) was 0,
now 100,000.
{p_end}

{com}. gen x=rchi2(5)
{txt}
{com}. hist x, name(histrchi2)
{txt}(bin={res}50{txt}, start={res}.0262338{txt}, width={res}.56077198{txt})
{res}{txt}
{com}. 
. clear 
{txt}
{com}. set obs 100000
{txt}{p}
Number of observations ({bf:_N}) was 0,
now 100,000.
{p_end}

{com}. gen x=rt(10)
{txt}
{com}. hist x, name(ttest)
{txt}(bin={res}50{txt}, start={res}-7.2048969{txt}, width={res}.29073382{txt})
{res}{txt}
{com}. 
. clear 
{txt}
{com}. set obs 100000
{txt}{p}
Number of observations ({bf:_N}) was 0,
now 100,000.
{p_end}

{com}. gen x = (rchi2(3)/3)/(rchi2(100)/100)
{txt}
{com}. hist x,name(histftest)
{txt}(bin={res}50{txt}, start={res}.00067209{txt}, width={res}.18728688{txt})
{res}{txt}
{com}. 
. 
. 
. 
. 
. 
{txt}end of do-file

{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\kwnabors\Desktop\HW1 Output.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 7 Apr 2022, 16:59:12
{txt}{.-}
{smcl}
{txt}{sf}{ul off}